Revit 2024 API
DocumentSet.Insert Method
Insert the specified item into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Insert(
	Document item
)
Visual Basic
Public Overridable Function Insert ( _
	item As Document _
) As Boolean
Visual C++
public:
virtual bool Insert(
	Document^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Document
The item to be inserted into the set.
Return Value
Returns whether the item was inserted into the set.
See Also
DocumentSet Class
Autodesk.Revit.DB Namespace